---
kind: type
id: T:Autodesk.Revit.DB.Structure.ZJustification
source: html/352abb3c-fd59-298e-94f6-63709b2b3d84.htm
---
# Autodesk.Revit.DB.Structure.ZJustification

The justification of the framing element in Z.

## Syntax (C#)
```csharp
public enum ZJustification
```